//[Ex01.java]
//다음중 기본 자료형 중 정수형 자료형이 아닌 것은? 2
//(1) int
//(2) float
//(3) byte
//(4) long

//[Ex02.java]
//JDK와 JRE의 차이점을 설명한 것 중 틀린 것을 찾아 수정해보세요?
//(1) 자바 프로그램을 개발하려면 JDK가 반드시 필요하다.
//(2) 자바 프로그램을 실행만 하려고 할 때는 JRE가 있으면 된다
//(3) JDK는 개발도구 와 JRE로 구성되어 있다 	
//(4) JDK에는 javac.exe가 포함되어 있지 않다	
		//3)자바 개발키트 + JRE + 라이브러리API+ 컴파일러등
		//4)포함(JVM)

//[Ex03.java]
//JVM에 대한 설명으로 틀린 것을 찾아 수정해보세요
//(1) JVM은 java.exe 명령어에 의해 구동된다
//(2) JVM은 바이트코드(~.class)를 기계어로 변환하여 실행시킨다. 				 
//(3) 운영체제별로 동일한 JVM이 사용된다.									 
//(4) 바이트코드(~.class)는 운영체제에 독립적이만, JVM은 운영체제에 종속적이다
		//2) 기계어 번역x
		//3) mac window linux 다름
	
//[Ex04.java]
//java 프로그램 개발과정을 순서대로 나열해 보세요		3 > 1 > 4 > 2
//(1) Javac.exe로 바이트코드(~.class)을 생성한다
//(2) Java.exe로 JVM을 실행시킨다.
//(3) 자바 소스파일(~.java)을 작성한다
//(4) JVM은 main() 메소드를 찾아 실행시킨다


//[Ex05.java]
//자바 소스파일(~. java)을 작성할 때 틀린 것을 찾아 수정해보세요
//(1) 패키지명은 일반적으로 가독성을 위해 대문자, 소문자 섞어 사용한다.
//(2) 클래스명은 소문자로만 구성하여 작성한다
//(3) 자바 소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야 한다.
//(4) 실행문 뒤(문자의 끝)에는 반드시 ( : )콜론을 사용해야 한다.
//(5) 처음으로 실행되는 함수의 이름은 개발자가 임의로 작성해서 만든다
		//4)실행문 뒤에는 ; 세미콜론을 사용해야한다

		
		
		
